#include <stdio.h>

int main(int argc, char const *argv[])
{
    int a[3][4] = {1,3,5,7,9,11,13,15,17,19,21,23};
    printf("a: %d,*a: %d\n",a,*a); 
    //a: 0行起始地址 *a: 0行0列元素地址  
    printf("a[0]: %d,*(a+0): %d\n",a[0],*(a+0));
    //a[0]: *(a+0): 0行0列元素地址
    printf("&a[0]: %d,&a[0][0]:%d\n",&a[0],&a[0][0]);
    //&a[0]: 0行起始地址 &a[0][0]： 0行0列元素地址

    printf("a[1]: %d, a+1: %d\n",a[1],a+1);
    //a[1]: 1行0列元素地址  a+1: 1行起始地址
    printf("&a[1][0]： %d,*(a+1)+0： %d\n",&a[1][0],*(a+1)+0);
    //第1行0列元素地址
    printf("a[2]: %d,*(a+2):%d\n",a[2],*(a+2));
    //第2行0元素地址

    printf("a[1][0]: %d,*(*(a+1)+0): %d",a[1][0],*(*(a+1)+0));
    //1行0列元素的值


    return 0;
}
